Revit 2027 API
AnalyticalSurfaceBase.IsOuterContourValid Method
 Checks if contour is valid for this Analytical Surface.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOuterContourValid(
	CurveLoop contour
)
Public Function IsOuterContourValid (
	contour As CurveLoop
) As Boolean
public:
bool IsOuterContourValid(
	CurveLoop^ contour
)
member IsOuterContourValid :
        contour : CurveLoop -> bool
Parameters
contour CurveLoop
 The curve loop to be checked.
Return Value
Boolean
 Returns true if curve loop is ok, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This method verifies if the contour is valid for a planar Analytical Surface or for a curved Analytical Panel.
See Also
Reference
AnalyticalSurfaceBase Class
Autodesk.Revit.DB.Structure Namespace